---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilyInstanceReferenceType.CenterElevation
enum: Autodesk.Revit.DB.FamilyInstanceReferenceType
source: html/ab424c61-4b80-9dcd-3f9a-7b35fa670edf.htm
---
# Autodesk.Revit.DB.FamilyInstanceReferenceType.CenterElevation

Reference plane whose "Is Reference" parameter is set to "Center (Elevation)". There may be no more than one such reference plane in the family.
 This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
 the dimension will survive.